app/controllers/clinic_controller.rb

  def index
		#raise session[:selected_program].to_yaml
    User.current = User.find(@user["user_id"]) rescue nil

    Location.current = Location.find(params[:location_id] || session[:location_id]) rescue nil
---
SELECT * FROM `users` WHERE (`users`.`user_id` = 1) AND (users.retired = 0)
SELECT * FROM `location` WHERE (`location`.`location_id` = 721) AND (location.retired = 0)

  def project_users_list
    users = User.find(:all, :conditions => ["username LIKE ? AND user_id IN (?)", "#{params[:username]}%",
        UserProperty.find(:all, :conditions => ["property = 'Status' AND property_value = 'ACTIVE'"]
        ).map{|user| user.user_id}], :limit => 50)
---
SELECT * FROM `user_property` WHERE (`user_property`.`property` = 'chronic.care.clinic.activities') AND (`user_property`.`user_id` = 1) LIMIT 1
SELECT * FROM `users` WHERE (username LIKE '%' AND user_id IN (1)) AND (users.retired = 0) LIMIT 50