app/controllers/encounters_controller.rb

  def create

    User.current = User.find(@user["user_id"]) rescue nil

    Location.current = Location.find(params[:location_id] || session[:location_id]) rescue nil

    patient = Patient.find(params[:patient_id]) rescue nil

    if !patient.nil?

      type = EncounterType.find_by_name(params[:encounter_type]).id rescue nil

      if !type.nil?
        @encounter = Encounter.create(
          :patient_id => patient.id,
          :provider_id => (params[:user_id]),
          :encounter_type => type,
          :location_id => (session[:location_id] || params[:location_id])
        )
---
SELECT * FROM `users` WHERE (`users`.`user_id` = 1) AND (users.retired = 0)
SELECT * FROM `location` WHERE (`location`.`location_id` = 721) AND (location.retired = 0)
SELECT * FROM `patient` WHERE (`patient`.`patient_id` = 176) AND (patient.voided = 0)
SELECT * FROM `encounter_type` WHERE (`encounter_type`.`name` = 'VITALS ') AND (encounter_type.retired = 0) LIMIT 1
INSERT INTO `encounter` (`creator`, `location_id`, `date_changed`, `changed_by`, `form_id`, `date_voided`, `encounter_type`, `provider_id`, `date_created`, `uuid`, `patient_id`, `voided_by`, `encounter_datetime`, `voided`, `void_reason`) VALUES(1, 721, NULL, NULL, NULL, NULL, 31, 1, '2013-05-06 09:06:57', '8a664736-b61b-11e2-a9db-0024be7f1be1', 175, NULL, '2013-05-06 09:06:57', 0, NULL)