app/controllers/patients_controller.rb

SELECT * FROM `patient` WHERE (`patient`.`patient_id` = 175) AND (patient.voided = 0)
SELECT * FROM `users` WHERE (`users`.`user_id` = 1) AND (users.retired = 0)
---
  def show
    @patient = Patient.find(params[:id] || params[:patient_id]) rescue nil

    if @patient.nil?
      redirect_to "/encounters/no_patient" and return
    end

    @retrospective = session[:datetime]
		@retrospective = Time.now if session[:datetime].blank?

    if params[:user_id].nil?
      redirect_to "/encounters/no_user" and return
    end

    @user = User.find(params[:user_id]) rescue nil

SELECT * FROM `user_property` WHERE (`user_property`.`user_id` = '1' AND `user_property`.`property` = 'chronic.care.clinic.activities') LIMIT 1
---
    @links = {}

		@project = get_global_property_value("project.name") rescue "Unknown"
		current_user_activities = UserProperty.find_by_user_id_and_property(params[:user_id],
      "#{@project.downcase.gsub(/\s/, ".")}.activities").property_value.split(",").collect{|a| a.downcase} rescue []

SELECT * FROM `patient` WHERE (`patient`.`patient_id` = 176) AND (patient.voided = 0)
SELECT * FROM `program_encounter` WHERE (`program_encounter`.`patient_id` = 176) AND ((DATE(date_time) = CURRENT_DATE()) AND (`program_encounter`.`patient_id` = 176))
---
  def current_visit
    @retrospective = session[:datetime]
		@retrospective = Time.now if session[:datetime].blank?


    @patient = Patient.find(params[:id] || params[:patient_id]) rescue nil

    ProgramEncounter.current_date = @retrospective

    @programs = @patient.program_encounters.find(:all, :conditions => ["DATE(date_time) = ?", @retrospective.to_date],
      :order => ["date_time DESC"]).collect{|p|

SELECT * FROM `patient` WHERE (`patient`.`patient_id` = 176) AND (patient.voided = 0)
SELECT * FROM `program_encounter` WHERE (`program_encounter`.`patient_id` = 176) ORDER BY date_time DESC
---
  def visit_history
    @patient = Patient.find(params[:id] || params[:patient_id]) rescue nil

    @programs = @patient.program_encounters.find(:all, :order => ["date_time DESC"]).collect{|p|

SELECT * FROM `users` WHERE (`users`.`user_id` = 1) AND (users.retired = 0)
SELECT * FROM `person` WHERE (`person`.`person_id` = 174) AND (person.voided = 0)
---
	def confirm
		session_date = session[:datetime] || Date.today

		@current_location = params[:location_id]
		@current_user = User.find(@user["user_id"])

		@found_person_id = params[:found_person_id] || session[:location_id]
		@relation = params[:relation] rescue []

    @person = Person.find(@found_person_id) rescue []

SELECT * FROM `location` WHERE (`location`.`location_id` = 721) AND (location.retired = 0)
---

		@arv_number = PatientService.get_patient_identifier(@person, 'ARV Number') rescue ""
		@patient_bean = PatientService.get_patient(@person) rescue ""
		@location = Location.find(params[:location_id] || session[:location_id]).name rescue nil