app/controllers/protocol_patients_controller.rb

SELECT * FROM `patient` WHERE (`patient`.`patient_id` = 176) AND (patient.voided = 0)
SELECT * FROM `users` WHERE (`users`.`user_id` = 1) AND (users.retired = 0)
---
	def hiv_status

    @patient = Patient.find(params[:patient_id]) rescue nil

    redirect_to '/encounters/no_patient' and return if @patient.nil?

    if params[:user_id].nil?
      redirect_to '/encounters/no_user' and return
    end

    @user = User.find(params[:user_id]) rescue nil?

SELECT * FROM `patient` WHERE (`patient`.`patient_id` = 175) AND (patient.voided = 0)
SELECT * FROM `users` WHERE (`users`.`user_id` = 1) AND (users.retired = 0)
---
	def treatment
    @current_program = current_program
    @patient = Patient.find(params[:patient_id]) rescue nil
    current_date = (!session[:datetime].nil? ? session[:datetime].to_date : Date.today)
    previous_days = 3.months
    current_date = current_date - previous_days
    redirect_to '/encounters/no_patient' and return if @patient.nil?

    if params[:user_id].nil?
      redirect_to '/encounters/no_user' and return
    end

    @user = User.find(params[:user_id]) rescue nil?

SELECT * FROM `patient` WHERE (`patient`.`patient_id` = 175) AND (patient.voided = 0)
SELECT * FROM `users` WHERE (`users`.`user_id` = 1) AND (users.retired = 0)
---
	def lab_results

    @patient = Patient.find(params[:patient_id]) rescue nil

    redirect_to '/encounters/no_patient' and return if @patient.nil?

    if params[:user_id].nil?
      redirect_to '/encounters/no_user' and return
    end

    @user = User.find(params[:user_id]) rescue nil?

SELECT * FROM `patient` WHERE (`patient`.`patient_id` = 176) AND (patient.voided = 0)
SELECT * FROM `users` WHERE (`users`.`user_id` = 1) AND (users.retired = 0)
---
	def vitals
    current_date = (!session[:datetime].nil? ? session[:datetime].to_date : Date.today)
    @patient = Patient.find(params[:patient_id]) #rescue nil

    redirect_to '/encounters/no_patient' and return if @patient.blank?

    if params[:user_id].nil?
      redirect_to '/encounters/no_user' and return
    end

    @user = User.find(params[:user_id]) rescue nil

SELECT * FROM `patient` WHERE (`patient`.`patient_id` = 175) AND (patient.voided = 0)
SELECT * FROM `users` WHERE (`users`.`user_id` = 1) AND (users.retired = 0)
---
	def outcomes

    @patient = Patient.find(params[:patient_id]) rescue nil

    redirect_to '/encounters/no_patient' and return if @patient.nil?

    if params[:user_id].nil?
      redirect_to '/encounters/no_user' and return
    end

    @user = User.find(params[:user_id]) rescue nil?

SELECT * FROM `patient` WHERE (`patient`.`patient_id` = 175) AND (patient.voided = 0)
SELECT * FROM `users` WHERE (`users`.`user_id` = 1) AND (users.retired = 0)
---
	def complications

    @patient = Patient.find(params[:patient_id]) rescue nil

    redirect_to '/encounters/no_patient' and return if @patient.nil?

    if params[:user_id].nil?
      redirect_to '/encounters/no_user' and return
    end

    @user = User.find(params[:user_id]) rescue nil?

SELECT * FROM `patient` WHERE (`patient`.`patient_id` = 175) AND (patient.voided = 0)
SELECT * FROM `users` WHERE (`users`.`user_id` = 1) AND (users.retired = 0)
---
	def assessment

    @patient = Patient.find(params[:patient_id]) rescue nil

    redirect_to '/encounters/no_patient' and return if @patient.nil?

    if params[:user_id].nil?
      redirect_to '/encounters/no_user' and return
    end

    @user = User.find(params[:user_id]) rescue nil?